experiments_old/05_heartbeat_elastic_vessel/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Experiment 05 — Heartbeat Flow with Elastic Vessel Wall (FSI).
// Same Murgo (1980) pressure waveform as Experiment 04, but now the vessel wall
// is compliant: the wall moves radially according to the thin-shell model
//   δR(t) = Δp(t) · R² / (E · h)
// where E = 0.5 MPa (arterial Young's modulus), h = 1 mm (wall thickness).
// Fluid: pimpleFoam (ALE, moving mesh).  Mesh motion: displacementLaplacian.
// This is a one-way FSI: the prescribed pressure drives the wall, the wall motion
// affects the fluid, but the fluid pressure does not feed back into the structural
// model.  Max radial displacement at systole (Δp = 40 mmHg): δR ≈ 0.267 mm
// (≈ 5.3 % of R), consistent with in-vivo measurements.
//
// Wall elasticity reference:
//   Holzapfel GA, Ogden RW. "Constitutive modelling of arteries."
//   Proc. Royal Society A. 2010;466:1551–1597. doi:10.1098/rspa.2009.0357
//   (open access — typical arterial E = 0.1–3 MPa)

application     pimpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;

// Run for 7.6 s (= 1τ, τ = R²/ν ≈ 7.6 s, ≈ 8.9 cardiac cycles) — same duration
// as Experiments 02–03 for direct Q(t) comparison on the same time axis.
endTime         7.6;

// deltaT = 0.002 s  →  CFL = U_center_peak * dt / dx
//        = 0.5 * 0.002 / 0.0025  (dx = L/40 = 0.1/40)
//        = 0.4  (< 1 ✓)
deltaT          0.002;

writeControl    runTime;
writeInterval   0.04;   // output folders: 0, 0.04, 0.08, ... 7.6  (190 snapshots)

purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

// ── Post-processing function objects ─────────────────────────────────────────
// Same as 02_heartbeat_laminar for direct comparison.
// The key validation here is the FLOW RATE chart: Q(t) must emerge from the
// prescribed pressure gradient and match the Hagen-Poiseuille analytical value.

functions
{
    // 1. Volume flow rate — conservation and Hagen-Poiseuille check
    //    In the pressure-driven case this is COMPUTED (not prescribed), so
    //    agreement with the analytical Q(t) directly validates the simulation.
    flowRateInlet
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        regionType      patch;
        name            inlet;
        operation       sum;
        fields          (phi);
        writeFields     false;
        log             true;
    }

    flowRateOutlet
    {
        type            surfaceFieldValue;
        libs            (fieldFunctionObjects);
        regionType      patch;
        name            outlet;
        operation       sum;
        fields          (phi);
        writeFields     false;
        log             true;
    }

    // 2. Wall shear stress (laminar coded FO — same as 02_heartbeat_laminar).
    //    τ_w_kin = nu · |snGrad(U)|  [m²/s²]; multiply by ρ = 1060 for Pa.
    wallShearStress
    {
        type            coded;
        libs            (utilityFunctionObjects);
        name            wallShearStressLaminar;

        codeExecute
        #{
            const volVectorField& U =
                mesh().lookupObject<volVectorField>("U");

            const dimensionedScalar nu
            (
                "nu",
                dimViscosity,
                mesh().lookupObject<IOdictionary>("transportProperties")
            );

            const label wallID =
                mesh().boundaryMesh().findPatchID("wall");

            if (wallID < 0)
            {
                WarningInFunction << "Patch 'wall' not found." << endl;
                return false;
            }

            const scalarField wssMag
            (
                nu.value() * mag(U.boundaryField()[wallID].snGrad())
            );

            Info<< "wallShearStress (kinematic) t=" << mesh().time().value()
                << "  min=" << min(wssMag)
                << "  max=" << max(wssMag)
                << "  mean=" << average(wssMag)
                << " [m2/s2]  (x1060 -> Pa)" << nl;

            return true;
        #};
    }

    // 3. Radial velocity profile at outlet — should match U_center(t)·(1−r²/R²).
    outletVelocityProfile
    {
        type            sets;
        libs            (sampling);
        interpolationScheme cellPoint;
        setFormat       raw;
        fields          (U);
        sets
        (
            outletRadialLine
            {
                type    uniform;
                axis    y;
                start   (0.1  0.0    0.0);
                end     (0.1  0.005  0.0);
                nPoints 50;
            }
        );
    }

    // 4. Pressure probes at two interior points to verify linear pressure gradient.
    //    Analytical: p(x,t) = p_inlet(t) · (1 − x/L)  (linear Hagen-Poiseuille)
    //    Quarter-point (x≈0.025m): p_quarter ≈ 0.75 · p_inlet
    //    Three-quarter-point (x≈0.075m): p_three_quarter ≈ 0.25 · p_inlet
    pressureProbes
    {
        type            probes;
        libs            (sampling);
        fields          (p);
        probeLocations
        (
            (0.02375  0.0  0.0)   // 10th cell centre  (≈ quarter-length)
            (0.07375  0.0  0.0)   // 30th cell centre  (≈ three-quarter-length)
        );
    }
}

// ************************************************************************* //
