experiments_old/05_heartbeat_elastic_vessel/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Experiment 05 — Elastic vessel wall: dynamic mesh configuration.
//
// The vessel wall moves radially according to the thin-shell compliance model.
// Wall displacement is prescribed via 0/pointDisplacement boundary conditions.
// The displacementLaplacian motion solver propagates these boundary displacements
// to the interior mesh points by solving a Laplace equation:
//
//   ∇·(γ ∇δ) = 0
//
// where δ is the point displacement field and γ = 1 (uniform diffusivity).
// This gives a smooth, mesh-quality-preserving deformation even for non-uniform
// boundary motion.

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolverLibs (fvMotionSolvers);
motionSolver    displacementLaplacian;

displacementLaplacianCoeffs
{
    diffusivity uniform 1;  // uniform stiffness — adequate for small deformations
}

// ************************************************************************* //
