experiments_old/05_heartbeat_elastic_vessel/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Experiment 05 — Elastic vessel wall FSI: same pressure waveform as Exp 04.
//
// icoFoam uses KINEMATIC pressure: p_kin = p_physical / rho  [m²/s²]
//
// ── Pressure waveform source ───────────────────────────────────────────────────
// The outlet pressure follows a physiologically realistic arterial waveform
// digitized from:
//   Murgo JP, Westerhof N, Giolma JP, Altobelli SA.
//   "Aortic input impedance in normal man: relationship to pressure wave forms."
//   Circulation. 1980;62(1):105-116. DOI: 10.1161/01.CIR.62.1.105
//
// Subject: healthy young adult (28 years), 70 bpm, T = 0.857 s.
// Features: rapid systolic upstroke → peak 120 mmHg → gradual decline →
//           dicrotic notch (~93 mmHg at t/T ≈ 0.44) → diastolic decay → 80 mmHg.
//
// 21 control points (t_s, p_mmHg) at equal spacing (Δt ≈ 0.043 s):
//
//  t [s]   p [mmHg]    phase
//  0.000      80       end-diastole
//  0.043      81
//  0.086      92
//  0.129     110
//  0.171     120       systolic peak
//  0.214     118
//  0.257     113
//  0.300     107
//  0.343     102
//  0.386      97
//  0.429      93       dicrotic notch
//  0.471      96       dicrotic wave (rebound)
//  0.514      92
//  0.557      89
//  0.600      87
//  0.643      85
//  0.686      83
//  0.729      82
//  0.771      81
//  0.814      80
//  0.857      80       = t = 0 (periodic)
//
// MAP (mean) ≈ (0+81+92+110+120+118+113+107+102+97+93+96+92+89+87+85+83+82+81+80)/20
//            ≈ 94.4 mmHg  (physiological: 93 mmHg for 120/80 waveform ✓)
//
// ── Boundary condition strategy ───────────────────────────────────────────────
//   p_outlet(t) = table_waveform(t)            [kinematic m²/s²]
//   p_inlet(t)  = p_outlet(t) + Δp_local       [tiny viscous gradient]
//   Δp_local    = 4·ν·L/R² · U_mean = 0.0528 × 0.275 = 0.01452 m²/s² ≈ 0.116 mmHg
//
// Note: codedFixedValue compiles a shared library at runtime.
//   OpenFOAM refuses compilation when running as root. Always start Docker
//   with:  docker run -u "$(id -u)":"$(id -g)" ...

dimensions      [0 2 -2 0 0 0 0];

// Initialise to end-diastolic pressure (80 mmHg kinematic).
internalField   uniform 10.061;   // 80 mmHg = 80 × 133.322 / 1060 m²/s²

boundaryField
{
    outlet
    {
        // p_outlet(t) = table_waveform(t) — realistic aortic pressure [m²/s²]
        type            codedFixedValue;
        value           uniform 10.061;   // 80 mmHg end-diastole initial [m²/s²]
        name            realisticPressureOutlet;

        code
        #{
            const scalar t = this->db().time().value();
            const scalar T = 0.857;   // cardiac period [s]

            // Waveform table — Murgo et al. (Circulation, 1980;62:105-116)
            // Healthy young adult, 70 bpm, systolic=120 mmHg, diastolic=80 mmHg
            const scalar tbl_t[] = {
                0.000, 0.043, 0.086, 0.129, 0.171, 0.214, 0.257,
                0.300, 0.343, 0.386, 0.429, 0.471, 0.514, 0.557,
                0.600, 0.643, 0.686, 0.729, 0.771, 0.814, 0.857
            };
            const scalar tbl_p[] = {   // [mmHg]
                80, 81, 92, 110, 120, 118, 113,
               107, 102,  97,  93,  96,  92,  89,
                87,  85,  83,  82,  81,  80,  80
            };
            const label N = 21;

            // Phase within cardiac cycle [0, T)
            scalar tmod = t - std::floor(t / T) * T;

            // Linear interpolation
            scalar p_mmhg = tbl_p[N - 1];
            for (label i = 0; i < N - 1; i++)
            {
                if (tmod >= tbl_t[i] && tmod < tbl_t[i + 1])
                {
                    scalar alpha = (tmod - tbl_t[i]) / (tbl_t[i + 1] - tbl_t[i]);
                    p_mmhg = tbl_p[i] + alpha * (tbl_p[i + 1] - tbl_p[i]);
                    break;
                }
            }

            // mmHg → kinematic [m²/s²]: × 133.322 Pa/mmHg ÷ 1060 kg/m³
            operator==(scalar(p_mmhg * 133.322 / 1060.0));
        #};
    }

    inlet
    {
        // p_inlet = p_outlet_waveform(t) + Δp_local
        // Δp_local = 4·ν·L/R² · U_mean = 0.0528 × 0.275 ≈ 0.01452 m²/s² ≈ 0.116 mmHg
        // (constant approximation — the exact value is negligible vs 80–120 mmHg signal)
        type            codedFixedValue;
        value           uniform 10.075;   // 80 mmHg + 0.116 mmHg ≈ 80.116 mmHg [m²/s²]
        name            realisticPressureInlet;

        code
        #{
            const scalar t = this->db().time().value();
            const scalar T = 0.857;

            const scalar tbl_t[] = {
                0.000, 0.043, 0.086, 0.129, 0.171, 0.214, 0.257,
                0.300, 0.343, 0.386, 0.429, 0.471, 0.514, 0.557,
                0.600, 0.643, 0.686, 0.729, 0.771, 0.814, 0.857
            };
            const scalar tbl_p[] = {   // [mmHg]
                80, 81, 92, 110, 120, 118, 113,
               107, 102,  97,  93,  96,  92,  89,
                87,  85,  83,  82,  81,  80,  80
            };
            const label N = 21;

            scalar tmod = t - std::floor(t / T) * T;

            scalar p_mmhg = tbl_p[N - 1];
            for (label i = 0; i < N - 1; i++)
            {
                if (tmod >= tbl_t[i] && tmod < tbl_t[i + 1])
                {
                    scalar alpha = (tmod - tbl_t[i]) / (tbl_t[i + 1] - tbl_t[i]);
                    p_mmhg = tbl_p[i] + alpha * (tbl_p[i + 1] - tbl_p[i]);
                    break;
                }
            }

            // Add Δp_local (0.116 mmHg → 0.01452 m²/s²) to drive flow
            operator==(scalar(p_mmhg * 133.322 / 1060.0 + 0.01452));
        #};
    }

    wall
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
